Revit 2026 API

# RenderingImageExposureSettingsWhitePoint Property

---

The white point value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double WhitePoint { get; set; }
```
```vb
Public Property WhitePoint As Double
	Get
	Set
```
```cpp
public:
property double WhitePoint {
	double get ();
	void set (double value);
}
```
```fsharp
member WhitePoint : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The value of white point is not valid. The valid range is 1800 to 15000. |

Specify the white balance of the rendering(measured in Kelvin). Incandescent lighting:2800 K; Daylight 6500K.

#### Reference

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace